Repository: asadbek824/yolgahamroh
Catalog: Components/DesignSystem/DesignSystem/Localizable.xcstrings
Source language: en
Languages: ru, uz

source: About us
ru: О нас
uz: Biz haqimizda

source: Add trip
ru: Добавить поездку
uz: Safar qo‘shish

source: App version
ru: Версия приложения
uz: Ilova versiyasi

source: Apply filters
ru: Применить фильтры
uz: Filtrlarni qo‘llash

source: Arrival time
ru: Время прибытия
uz: Yetib kelish vaqti

source: Available seats
ru: Свободные места
uz: Bo‘sh o‘rinlar

# book_button
source: Book
ru: Забронировать
uz: Bron qilish

source: Call driver
ru: Позвонить водителю
uz: Haydovchiga qo‘ng‘iroq qilish

# cancel_button
source: Cancel
ru: Отменить
uz: Bekor qilish

# car_label
source: Car
ru: Машина
uz: Mashina

# card_payment
source: Card
ru: Карта
uz: Karta

# cash_payment
source: Cash
ru: Наличные
uz: Naqd

source: Clear filters
ru: Очистить фильтры
uz: Filtrlarni tozalash

# confirm_button
source: Confirm
ru: Подтвердить
uz: Tasdiqlash

source: Contact driver
ru: Связаться с водителем
uz: Haydovchiga bog‘lanish

source: Contact us
ru: Связаться с нами
uz: Biz bilan bog‘lanish

# delete_button
source: Delete
ru: Удалить
uz: O‘chirish

source: Delete trip
ru: Удалить поездку
uz: Safarni o‘chirish

source: Departure time
ru: Время отправления
uz: Jo‘nash vaqti

source: Disable notifications
ru: Выключить уведомления
uz: Bildirishnomalarni o‘chirish

# distance_label
source: Distance
ru: Расстояние
uz: Masofa

# done_button
source: Done
ru: Готово
uz: Tayyor

source: Driver name
ru: Имя водителя
uz: Haydovchi ismi

# driver_title
source: Driver
ru: Водителю
uz: Haydovchiga

# edit_button
source: Edit
ru: Редактировать
uz: Tahrirlash

source: Edit Profile
ru: Редактировать профиль
uz: Profilni tahrirlash

source: Edit trip
ru: Редактировать поездку
uz: Safarni tahrirlash

source: Enable notifications
ru: Включить уведомления
uz: Bildirishnomalarni yoqish

# error_message
source: Something went wrong
ru: Что-то пошло не так
uz: Xatolik yuz berdi

# error_no_connection
source: No internet connection
ru: Нет подключения к интернету
uz: Internet ulanmagan

# error_server
source: Server error
ru: Ошибка сервера
uz: Server xatosi

# error_timeout
source: Request timed out
ru: Время ожидания истекло
uz: So‘rov vaqti tugadi

# filter_title
source: Filters
ru: Фильтры
uz: Filtrlar

source: Find a driver
ru: Найти водителя
uz: Haydovchi topish

source: Find a passenger
ru: Найти пассажира
uz: Yo‘lovchi topish

# from_label
source: From
ru: Откуда
uz: Qayerdan

# help_title
source: Help
ru: Помощь
uz: Yordam

# home_title
source: Home
ru: Главная
uz: Asosiy

source: How it works
ru: Как это работает
uz: Qanday ishlaydi

# intro_text
source: Find and share rides easily
ru: Находите и предлагайте поездки легко
uz: Safarlarni oson toping va ulashing

# language_title
source: Language
ru: Язык
uz: Til

# loading_label
source: Loading...
ru: Загрузка...
uz: Yuklanmoqda...

# login_button
source: Log in
ru: Войти
uz: Kirish

# logout_button
source: Logout
ru: Выйти
uz: Chiqish

# logout_message
source: You can log in again at any time.
ru: Вы сможете войти снова в любой момент.
uz: Istalgan vaqtda qayta kirishingiz mumkin.

# logout_title
source: Log out of account?
ru: Выйти из аккаунта?
uz: Hisobdan chiqmoqchimisiz?

source: Luggage allowed
ru: Багаж разрешён
uz: Yuk ruxsat etilgan

source: Message driver
ru: Написать водителю
uz: Haydovchiga yozish

# my_trips_title
source: My Trips
ru: Мои поездки
uz: Safarlarim

# no_button
source: No
ru: Нет
uz: Yo‘q

# no_results
source: No results found
ru: Результаты не найдены
uz: Natijalar topilmadi

source: No trips found
ru: Поездок не найдено
uz: Safarlar topilmadi

# notification_title
source: Notifications
ru: Уведомления
uz: Bildirishnomalar

# ok_button
source: OK
ru: ОК

# open_settings_button
source: Open settings
ru: Открыть настройки
uz: Sozlamalarni ochish

# passengers_label
source: Passengers
ru: Пассажиры
uz: Yo‘lovchilar

source: Past trips
ru: Прошлые поездки
uz: O‘tgan safarlar

source: Payment method
ru: Способ оплаты
uz: To‘lov usuli

# payment_title
source: Payment
ru: Оплата
uz: To‘lov

source: Per person
ru: На человека
uz: Har bir kishi uchun

source: Pets allowed
ru: Животные разрешены
uz: Hayvonlarga ruxsat etilgan

# photo_permission_message
source: Allow access to Photos to choose an avatar.
ru: Разрешите доступ к Фото, чтобы выбрать аватар.
uz: Avatar tanlash uchun Fotosuratlarga ruxsat bering.

# photo_permission_title
source: Photo access disabled
ru: Доступ к фото отключён
uz: Foto ruxsati o‘chirilgan

# price_label
source: Price
ru: Цена
uz: Narx

source: Privacy Policy
ru: Политика конфиденциальности
uz: Maxfiylik siyosati

# profile_title
source: Profile
ru: Профиль
uz: Profil

# rate_app
source: Rate the app
ru: Оценить приложение
uz: Ilovani baholash

# receiving_label
source: Receiving...
ru: Получение...
uz: Qabul qilinmoqda...

# retry_button
source: Retry
ru: Повторить
uz: Qayta urinib ko‘rish

source: Ride sharing
ru: Совместная поездка
uz: Birga safar

# save_button
source: Save
ru: Сохранить
uz: Saqlash

# search_button
source: Search
ru: Найти
uz: Qidirish

# search_placeholder
source: Where do you want to go?
ru: Куда хотите поехать?
uz: Qayerga bormoqchisiz?

source: Searching rides...
ru: Поиск поездок...
uz: Safarlar qidirilmoqda...

source: Seats available
ru: Доступные места
uz: Bo‘sh o‘rinlar

source: Seats taken
ru: Занятые места
uz: Band o‘rinlar

# sending_label
source: Sending...
ru: Отправка...
uz: Yuborilmoqda...

# settings_title
source: Settings
ru: Настройки
uz: Sozlamalar

# share_app
source: Share the app
ru: Поделиться приложением
uz: Ilovani ulashish

# signup_button
source: Sign up
ru: Зарегистрироваться
uz: Ro‘yxatdan o‘tish

# skip_button
source: Skip
ru: Пропустить
uz: O‘tkazib yuborish

source: Smoking allowed
ru: Курение разрешено
uz: Chekish ruxsat etilgan

source: Sort by distance
ru: Сортировать по расстоянию
uz: Masofa bo‘yicha saralash

source: Sort by price
ru: Сортировать по цене
uz: Narx bo‘yicha saralash

source: Sort by time
ru: Сортировать по времени
uz: Vaqt bo‘yicha saralash

# step_one
source: Search for a ride
ru: Найдите поездку
uz: Safar qidiring

# step_three
source: Travel together
ru: Путешествуйте вместе
uz: Birga sayohat qiling

# step_two
source: Book your seat
ru: Забронируйте место
uz: O‘rningizni bron qiling

# success_message
source: Booking successful
ru: Бронирование успешно
uz: Bron muvaffaqiyatli

# terms_title
source: Terms & Conditions
ru: Условия использования
uz: Foydalanish shartlari

# to_label
source: To
ru: Куда
uz: Qayerga

# today_label
source: Today
ru: Сегодня
uz: Bugun

# tomorrow_label
source: Tomorrow
ru: Завтра
uz: Ertaga

source: Total price
ru: Общая цена
uz: Umumiy narx

source: Trip canceled
ru: Поездка отменена
uz: Safar bekor qilindi

# trip_created
source: Trip created successfully
ru: Поездка успешно создана
uz: Safar muvaffaqiyatli yaratildi

# trip_deleted
source: Trip deleted successfully
ru: Поездка успешно удалена
uz: Safar muvaffaqiyatli o‘chirildi

# trip_details_title
source: Trip details
ru: Детали поездки
uz: Safar tafsilotlari

source: Trip duration
ru: Длительность поездки
uz: Safar davomiyligi

# trip_full
source: Trip is full
ru: Поездка заполнена
uz: Safar to‘ldi

source: Trip rules
ru: Правила поездки
uz: Safar qoidalari

# trip_updated
source: Trip updated successfully
ru: Поездка успешно обновлена
uz: Safar muvaffaqiyatli yangilandi

source: Try again later
ru: Попробуйте позже
uz: Keyinroq urinib ko‘ring

source: Upcoming trips
ru: Предстоящие поездки
uz: Yaqin safarlar

# updating_label
source: Updating...
ru: Обновление...
uz: Yangilanmoqda...

# yes_button
source: Yes
ru: Да
uz: Ha

# yesterday_label
source: Yesterday
ru: Вчера
uz: Kecha
